# 주석 : 설명이나 메모하고싶은 내용을 작성

# 변수 : '값을 메모리에 저장'하기 위한 기억 공간
# 데이터 분석 분야에서는 '특성'을 의미하기도 함

# 변수 정의 / 변수선언
# a1이라는 변수를 생성한 후 10을 저장
a1 <- 10

# 변수의 이름만 작성하고 실행하면 값이 출력된다
a1

# R 버전이 업데이트 되면서 =로도 값을 저장할 수 있다.
a2 = 10

# 만약 변수의 값을 다른 것으로 지정하면 덮어씌기됌

a1 <-30
a1

#변수에 저장되어 있는 값을 사용할 때는 변수의 이름만 작성함
a1 + a2
a1 - a2
a1 * a2
a1 / a2

# ................


# 객체 :다수의 값, 1차원 행렬 생성
var1 <- c(1, 2, 5, 7, 8)
var1

var2 <- c(1: 5)
var2




var3 <- seq(1, 5)
var3

var4 <- seq(1, 10, by = 2)

var5[1]
var5[2]
var5[3] 
R에서는 벡터와 연산

var 11 = var1 - 2
var 12 = var1 * 2
var 13 = var1  / 2


